[
  {
    "id": "Q01",
    "q": "How do I create a seller account on Shoplite?",
    "a": "To create a seller account, visit the Shoplite seller registration page, provide business information including tax ID, link a bank account for payouts, and complete the verification process which takes 2–3 business days.",
    "required": ["seller registration", "business verification", "2-3 business days"],
    "forbidden": ["instant approval", "no verification required", "personal accounts"]
  },
  {
    "id": "Q02",
    "q": "What payment methods can I use on Shoplite?",
    "a": "Shoplite supports credit and debit cards, PayPal, Apple Pay, Google Pay, and in some regions bank transfers or cash-on-delivery. All transactions are processed securely through PCI-DSS compliant gateways.",
    "required": ["credit and debit cards", "PayPal", "Apple Pay", "Google Pay", "PCI-DSS"],
    "forbidden": ["unsupported", "unverified", "cryptocurrency"]
  },
  {
    "id": "Q03",
    "q": "How long do I have to return a product on Shoplite?",
    "a": "Shoplite offers a 30-day return window starting from the delivery date. Buyers must request a return authorization number (RAN) before shipping items back.",
    "required": ["30-day return window", "return authorization number", "delivery date"],
    "forbidden": ["no returns", "lifetime returns"]
  },
  {
    "id": "Q04",
    "q": "How are Shoplite reviews verified?",
    "a": "Reviews are tied to verified purchases and pass through moderation filters that block offensive or irrelevant content. Verified purchase labels ensure authenticity, and sellers cannot delete or alter customer reviews.",
    "required": ["verified purchase", "moderation", "authenticity"],
    "forbidden": ["all reviews are anonymous", "sellers can delete reviews", "AI models"]
  },
  {
    "id": "Q05",
    "q": "What types of delivery options are available?",
    "a": "Buyers can choose standard (3–7 days), express (1–3 days), or same-day delivery in select regions. Notifications are provided at each stage of the order.",
    "required": ["standard", "express", "same-day delivery"],
    "forbidden": ["no delivery tracking", "pickup only"]
  },
  {
    "id": "Q06",
    "q": "How much commission does Shoplite charge sellers?",
    "a": "Shoplite charges 10% commission per sale plus a $0.50 transaction fee. Rates vary by category—luxury goods at 12% and digital goods as low as 5%.",
    "required": ["10% commission", "$0.50 transaction fee", "category-based rates"],
    "forbidden": ["no commission", "hidden fees"]
  },
  {
    "id": "Q07",
    "q": "What mobile-specific features does Shoplite provide?",
    "a": "The mobile app includes barcode scanning, biometric login, offline browsing, push notifications, and one-tap checkout, alongside core shopping features.",
    "required": ["barcode scanning", "biometric login", "offline browsing", "push notifications"],
    "forbidden": ["mobile app not supported"]
  },
  {
    "id": "Q08",
    "q": "How does Shoplite protect user data?",
    "a": "Shoplite encrypts data in transit and at rest, complies with GDPR and CCPA, and provides user-controlled privacy settings. In the event of a breach, users are informed within 72 hours.",
    "required": ["GDPR", "CCPA", "encryption", "72 hours disclosure"],
    "forbidden": ["no privacy policy", "data sold by default"]
  },
  {
    "id": "Q09",
    "q": "What are Shoplite’s return policies and how do I track my order status?",
    "a": "Shoplite offers a 30-day return window that requires a return authorization number (RAN). Buyers can track orders in real time via the “My Orders” dashboard with updates from confirmation through delivery.",
    "required": ["30-day return window", "return authorization", "order tracking"],
    "forbidden": ["no returns accepted", "lifetime returns"]
  },
  {
    "id": "Q10",
    "q": "How do sellers manage stock and prevent overselling?",
    "a": "Sellers manage inventory via dashboard, CSV, or API with real-time synchronization and low-stock alerts. Checkout verifies stock to prevent overselling, reserving items during the purchase flow.",
    "required": ["real-time synchronization", "API integrations", "prevent overselling"],
    "forbidden": ["overselling allowed", "no inventory system"]
  },
  {
    "id": "Q11",
    "q": "How does Shoplite handle fraudulent transactions?",
    "a": "Fraud detection algorithms flag anomalies and may pause transactions for verification. Urgent fraud cases are prioritized and escalated by customer support for rapid resolution.",
    "required": ["fraud detection", "verification", "escalated support"],
    "forbidden": ["fraud ignored", "no fraud detection"]
  },
  {
    "id": "Q12",
    "q": "How can developers integrate with Shoplite?",
    "a": "Developers use RESTful APIs with OAuth 2.0 to manage listings, orders, inventory, and more. The platform enforces rate limits and provides a sandbox for safe testing.",
    "required": ["RESTful APIs", "OAuth 2.0", "rate limits", "sandbox"],
    "forbidden": ["no authentication", "open APIs without limits"]
  },
  {
    "id": "Q13",
    "q": "What are the responsibilities of sellers regarding shipping?",
    "a": "Sellers must provide tracking numbers within 24 hours of dispatch, define shipping policies in the Seller Dashboard, and ensure on-time delivery or face penalties.",
    "required": ["tracking numbers", "24 hours", "shipping policies"],
    "forbidden": ["no shipping responsibility", "Shoplite delivers all orders"]
  },
  {
    "id": "Q14",
    "q": "What customer support options are available on Shoplite?",
    "a": "Support is available 24/7 via live chat, email, phone, and an AI-powered chatbot. The Help Center and the mobile app offer self-service tools and push-notification updates.",
    "required": ["24/7 support", "AI-powered chatbot", "Help Center"],
    "forbidden": ["support not available", "limited hours only"]
  },
  {
    "id": "Q15",
    "q": "How does Shoplite ensure fairness in product reviews?",
    "a": "Only verified purchasers can review; submissions are moderated to remove offensive or irrelevant content. Reviews carry a “verified purchase” label, and sellers cannot delete or alter them.",
    "required": ["verified reviews", "moderation", "sellers cannot delete"],
    "forbidden": ["fake reviews allowed", "sellers can delete reviews", "AI detection"]
  },
  {
    "id": "Q16",
    "q": "How are promotional codes validated at checkout?",
    "a": "Promotional codes are validated in real time at checkout. Expired or ineligible codes trigger clear error messages, and attempts to stack incompatible codes are automatically blocked.",
    "required": ["validated in real time", "error messages", "fraudulent stacking blocked"],
    "forbidden": ["any code works", "no restrictions"]
  },
  {
    "id": "Q17",
    "q": "How do Shoplite Plus subscriptions benefit sellers?",
    "a": "Shoplite Plus reduces commissions—sometimes to about 7%—in exchange for a monthly subscription and provides benefits like improved search placement and promotional tools.",
    "required": ["Shoplite Plus", "reduced commissions", "monthly subscription"],
    "forbidden": ["free upgrade", "no subscription required"]
  },
  {
    "id": "Q18",
    "q": "What measures does Shoplite take for data breaches?",
    "a": "Shoplite informs affected users within 72 hours, initiates incident response and investigations immediately, and uses support channels to guide users while applying safeguards to prevent recurrence.",
    "required": ["72 hours", "incident response", "investigations"],
    "forbidden": ["no disclosure", "hidden breaches"]
  },
  {
    "id": "Q19",
    "q": "How do buyers receive updates about their orders?",
    "a": "Buyers receive updates by email, SMS, or mobile push notifications and can track progress from confirmation to delivery in the “My Orders” dashboard.",
    "required": ["email", "SMS", "push notifications", "My Orders dashboard"],
    "forbidden": ["no updates available"]
  },
  {
    "id": "Q20",
    "q": "How can sellers forecast demand and adjust stock?",
    "a": "Sellers use analytics in the inventory dashboard—such as seasonal trends and historical sales—to forecast demand, set low-stock thresholds, and prioritize fast-moving items.",
    "required": ["analytics", "forecast demand", "seasonal trends", "inventory dashboard"],
    "forbidden": ["no forecasting tools", "Shoplite sets inventory"]
  }
]
